Yevgeniy-Olexandrenko/smalltv-esp32s3-board/firmware/src/audio/output/OutputI2S.cpp
#include <esp32-hal.h>
#include <driver/i2s.h>
#include "OutputI2S.h"

namespace audio
{
    OutputI2S::OutputI2S(int port, int output_mode, int dma_buf_count, int use_apll)
    {
        this->portNo = port;
        this->i2sOn = false;
        this->dma_buf_count = dma_buf_count;
        if (output_mode != EXTERNAL_I2S && output_mode != INTERNAL_DAC && output_mode != INTERNAL_PDM) 
        {
            output_mode = EXTERNAL_I2S;
        }
        this->output_mode = output_mode;
        this->use_apll = use_apll;

        //set defaults
        mono = false;
        lsb_justified = false;
        bps = 16;
        channels = 2;
        hertz = 44100;

        bclkPin = 26;
        wclkPin = 25;
        doutPin = 22;
        mclkPin = 0;
        SetGain(1.0);
    }

    OutputI2S::~OutputI2S()
    {
        stop();
    }

    bool OutputI2S::SetPinout(int bclk, int wclk, int dout)
    {
        bclkPin = bclk;
        wclkPin = wclk;
        doutPin = dout;
        return (i2sOn ? SetPinout() : true);
    }

    bool OutputI2S::SetPinout(int bclk, int wclk, int dout, int mclk)
    {
        bclkPin = bclk;
        wclkPin = wclk;
        doutPin = dout;
        mclkPin = mclk;
        return (i2sOn ? SetPinout() : true);
    }

    bool OutputI2S::SetRate(int hz)
    {
        // TODO:
        // have a list of allowable rates 
        // from constructor, check them
        this->hertz = hz;
        if (i2sOn)
        {
            i2s_set_sample_rates((i2s_port_t)portNo, AdjustI2SRate(hz));
        }
        return true;
    }

    bool OutputI2S::SetBitsPerSample(int bits)
    {
        if (bits != 16 && bits != 8) return false;
        this->bps = bits;
        return true;
    }

    bool OutputI2S::SetChannels(int channels)
    {
        if (channels < 1 || channels > 2) return false;
        this->channels = channels;
        return true;
    }

    bool OutputI2S::begin()
    {
        return begin(true);
    }

    bool OutputI2S::ConsumeSample(int16_t sample[2])
    {
        //return if we haven't called ::begin yet
        if (!i2sOn) return false;

        int16_t ms[2];
        ms[0] = sample[0];
        ms[1] = sample[1];
        MakeSampleStereo16( ms );

        if (this->mono) 
        {
            // Average the two samples and overwrite
            int32_t ttl = ms[LEFTCHANNEL] + ms[RIGHTCHANNEL];
            ms[LEFTCHANNEL] = ms[RIGHTCHANNEL] = (ttl >> 1) & 0xffff;
        }

        uint32_t s32;
        if (output_mode == INTERNAL_DAC)
        {
            int16_t l = Amplify(ms[LEFTCHANNEL]) + 0x8000;
            int16_t r = Amplify(ms[RIGHTCHANNEL]) + 0x8000;
            s32 = ((r & 0xffff) << 16) | (l & 0xffff);
        }
        else
        {
            s32 = ((Amplify(ms[RIGHTCHANNEL])) << 16) | (Amplify(ms[LEFTCHANNEL]) & 0xffff);
        }
        
        size_t i2s_bytes_written;
        i2s_write((i2s_port_t)portNo, (const char*)&s32, sizeof(uint32_t), &i2s_bytes_written, 0);
        return i2s_bytes_written;
    }

    void OutputI2S::flush()
    {
        // makes sure that all stored DMA samples are consumed/played
        int buffersize = 128 * this->dma_buf_count;
        int16_t samples[2] = { 0x0, 0x0 };
        for (int i = 0; i < buffersize; i++)
        {
            while (!ConsumeSample(samples))
            {
                delay(10);
            }
        }        
    }

    bool OutputI2S::stop()
    {
        if (!i2sOn) return false;

        i2s_zero_dma_buffer((i2s_port_t)portNo);
        // audioLogger->printf("UNINSTALL I2S\n");
        i2s_driver_uninstall((i2s_port_t)portNo); //stop & destroy i2s driver
        i2sOn = false;
        return true;
    }

    bool OutputI2S::begin(bool txDAC)
    {
        if (!i2sOn)
        {
            if (use_apll == APLL_AUTO)
            {
                // don't use audio pll on buggy rev0 chips
                use_apll = APLL_DISABLE;
                // esp_chip_info_t out_info;
                // esp_chip_info(&out_info);
                // if (out_info.revision > 0)
                {
                    use_apll = APLL_ENABLE;
                }
            }

            i2s_mode_t mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);
            if (output_mode == INTERNAL_DAC)
            {
                #if CONFIG_IDF_TARGET_ESP32
                mode = (i2s_mode_t)(mode | I2S_MODE_DAC_BUILT_IN);
                #else
                return false;      
                #endif
            }
            else if (output_mode == INTERNAL_PDM)
            {
                #if CONFIG_IDF_TARGET_ESP32
                mode = (i2s_mode_t)(mode | I2S_MODE_PDM);
                #else
                return false;      
                #endif
            }

            i2s_comm_format_t comm_fmt;
            if (output_mode == INTERNAL_DAC)
            {
                comm_fmt = (i2s_comm_format_t) I2S_COMM_FORMAT_STAND_MSB;
            }
            else if (lsb_justified)
            {
                comm_fmt = (i2s_comm_format_t) I2S_COMM_FORMAT_STAND_MSB;
            }
            else
            {
                comm_fmt = (i2s_comm_format_t) I2S_COMM_FORMAT_STAND_I2S;
            }

            i2s_config_t i2s_config_dac = 
            {
                .mode = mode,
                .sample_rate = 44100,
                .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
                .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
                .communication_format = comm_fmt,
                .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1, // lowest interrupt priority
                .dma_buf_count = dma_buf_count,
                .dma_buf_len = 128,
                .use_apll = use_apll, // Use audio PLL
                .tx_desc_auto_clear = true, // Silence on underflow
                .fixed_mclk = use_mclk, // Unused
                .mclk_multiple = I2S_MCLK_MULTIPLE_256, // Unused
                .bits_per_chan = I2S_BITS_PER_CHAN_DEFAULT // Use bits per sample
            };

            // audioLogger->printf("+%d %p\n", portNo, &i2s_config_dac);

            if (i2s_driver_install((i2s_port_t)portNo, &i2s_config_dac, 0, NULL) != ESP_OK)
            {
                // audioLogger->println("ERROR: Unable to install I2S drives\n");
            }

            if (output_mode == INTERNAL_DAC || output_mode == INTERNAL_PDM)
            {
                #if CONFIG_IDF_TARGET_ESP32
                i2s_set_pin((i2s_port_t)portNo, NULL);
                i2s_set_dac_mode(I2S_DAC_CHANNEL_BOTH_EN);
                #else
                return false;
                #endif
            }
            else
            {
                SetPinout();
            }
            i2s_zero_dma_buffer((i2s_port_t)portNo);
        }
        
        i2sOn = true;
        SetRate(hertz); // Default
        return true;
    }

    bool OutputI2S::SetOutputModeMono(bool mono)
    {
        this->mono = mono;
        return true;
    }

    bool OutputI2S::SetLsbJustified(bool lsbJustified)
    {
        this->lsb_justified = lsbJustified;
        return true;
    }

    bool OutputI2S::SetMclk(bool enabled)
    {
        if (output_mode == INTERNAL_DAC || output_mode == INTERNAL_PDM)
            return false; // Not allowed

        use_mclk = enabled;
        return true;
    }

    bool OutputI2S::SwapClocks(bool swap_clocks)
    {
        if (i2sOn) return false; // Not allowed
        this->swap_clocks = swap_clocks;
        return true;
    }

    bool OutputI2S::SetPinout()
    {
        if (output_mode == INTERNAL_DAC || output_mode == INTERNAL_PDM) 
            return false; // Not allowed

        i2s_pin_config_t pins = 
        {
            .mck_io_num = mclkPin,
            .bck_io_num = bclkPin,
            .ws_io_num = wclkPin,
            .data_out_num = doutPin,
            .data_in_num = I2S_PIN_NO_CHANGE
        };

        i2s_set_pin((i2s_port_t)portNo, &pins);
        return true;
    }
}
